// Приведение к булю на примере Boolean(value)

// console.log(Boolean(0));


// Логическое И(оператор &&)
//     - запинается на лжи
//     - возвращает то, на чем заплнулось или последний операнд

// console.log(5 && 4 && 7 && 'mango');



// Логическое ИЛИ (оператор||)
    // -запинается на правде
    // - возвращает то, на чем запнулось или последний операнд, если все Ложь

// console.log(false || 0 || 8 || 10);



// Логическое НЕ(оператор!)
//     - делает инверсию Правда > Ложь и Ложь > Правда
//      то есть то что Ложь приводит к Правде и наоборот

// console.log(!0);
 
